waldo/app/controllers/puzzles_controller.rb

SELECT "puzzles".* FROM "puzzles"
---
  def index
    @puzzles = Puzzle.all

SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @puzzle = Puzzle.find(params[:id])

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT 1  [["id", nil]]
---
  def check_character(id, x, y)
    @puzzle = Puzzle.fi     nd(params[:id])
    @character = puzzle.characters.find(:id)