app/controllers/puzzles_controller.rb

SELECT "puzzles".* FROM "puzzles"
---
  def index
    @puzzles = Puzzle.all

SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @puzzle = Puzzle.find(params[:id])

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "puzzles" SET "toptime" = $1, "updated_at" = $2 WHERE "puzzles"."id" = $3  [["toptime", 12], ["updated_at", "2016-04-17 18:27:07.466973"], ["id", 1]]
---
  def check_character
    @character = Character.find(params[:c])
    @puzzle = @character.puzzle
    response = {}
    response[:status] = @character.check_location(params[:x], params[:y])
    response[:solve_time] = 0

    if response[:status] == "found"
      found(@character.id)
    end

    if puzzle_solved?
      response[:solve_time] = (Time.now - Time.parse(session[:start_time])).floor
      if @puzzle.toptime == nil
        response[:new_toptime] = "yes"
      elsif response[:solve_time] < @puzzle.toptime
        response[:new_toptime] = "yes"
        @puzzle.update_attribute(:toptime, response[:solve_time]);

SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "puzzles" SET "topholder" = $1, "updated_at" = $2 WHERE "puzzles"."id" = $3  [["topholder", "Luke"], ["updated_at", "2016-04-17 18:14:53.646394"], ["id", 1]]
---
  def submit_toptime
    response = {}
    @puzzle = Puzzle.find(params[:id])
    @puzzle.update_attribute(:topholder, params[:n])